<?php
$config = array (
		//签名方式,默认为RSA2(RSA2048)
		'sign_type' => "RSA2",//因官方要求扫码支付前面方式需使用RSA2格式，在使用官方公私钥生成工具时，需选择2048长度

		//支付宝公钥
		'alipay_public_key' => "",

		//商户私钥，您的原始格式RSA私钥
		'merchant_private_key' => "",

		//编码格式
		'charset' => "UTF-8",

		//支付宝网关
		'gatewayUrl' => "https://openapi.alipay.com/gateway.do",

		//应用ID
		'app_id' => "",

		//异步通知地址,只有扫码支付预下单可用
		/*********************************************************/
		/**********************特别注意***************************/
		/*********************************************************/

		//请注意该回调地址需外网可以访问且所在方法不需要用户进行登录


		'notify_url' => "",//此处需根据实际情况进行修改，请注意该回调地址需外网可以访问且所在方法不需要用户进行登录

		//最大查询重试次数
		'MaxQueryRetry' => "10",

		//查询间隔
		'QueryDuration' => "3"
);